MikroElektronika/core_packages/PIC/XC8/def/PIC18LF44J11/mcu.h
extern volatile PMDIN2Lbits_t PMDIN2Lbits __at(0xF58);
// bitfield macros
#define _PMDIN2L_DATAL_POSN                                 0x0
#define _PMDIN2L_DATAL_POSITION                             0x0
#define _PMDIN2L_DATAL_SIZE                                 0x8
#define _PMDIN2L_DATAL_LENGTH                               0x8
#define _PMDIN2L_DATAL_MASK                                 0xFF

// Register: PMDIN2H
#define PMDIN2H PMDIN2H
extern volatile unsigned char           PMDIN2H             __at(0xF59);
#ifndef _LIB_BUILD
asm("PMDIN2H equ 0F59h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DATAH                  :8;
    };
} PMDIN2Hbits_t;
extern volatile PMDIN2Hbits_t PMDIN2Hbits __at(0xF59);
// bitfield macros
#define _PMDIN2H_DATAH_POSN                                 0x0
#define _PMDIN2H_DATAH_POSITION                             0x0
#define _PMDIN2H_DATAH_SIZE                                 0x8
#define _PMDIN2H_DATAH_LENGTH                               0x8
#define _PMDIN2H_DATAH_MASK                                 0xFF

// Register: PMDOUT2L
#define PMDOUT2L PMDOUT2L
extern volatile unsigned char           PMDOUT2L            __at(0xF5A);
#ifndef _LIB_BUILD
asm("PMDOUT2L equ 0F5Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DATAL                  :8;
    };
} PMDOUT2Lbits_t;
extern volatile PMDOUT2Lbits_t PMDOUT2Lbits __at(0xF5A);
// bitfield macros
#define _PMDOUT2L_DATAL_POSN                                0x0
#define _PMDOUT2L_DATAL_POSITION                            0x0
#define _PMDOUT2L_DATAL_SIZE                                0x8
#define _PMDOUT2L_DATAL_LENGTH                              0x8
#define _PMDOUT2L_DATAL_MASK                                0xFF

// Register: PMDOUT2H
#define PMDOUT2H PMDOUT2H
extern volatile unsigned char           PMDOUT2H            __at(0xF5B);
#ifndef _LIB_BUILD
asm("PMDOUT2H equ 0F5Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DATAH                  :8;
    };
} PMDOUT2Hbits_t;
extern volatile PMDOUT2Hbits_t PMDOUT2Hbits __at(0xF5B);
// bitfield macros
#define _PMDOUT2H_DATAH_POSN                                0x0
#define _PMDOUT2H_DATAH_POSITION                            0x0
#define _PMDOUT2H_DATAH_SIZE                                0x8
#define _PMDOUT2H_DATAH_LENGTH                              0x8
#define _PMDOUT2H_DATAH_MASK                                0xFF

// Register: PMMODEL
#define PMMODEL PMMODEL
extern volatile unsigned char           PMMODEL             __at(0xF5C);
#ifndef _LIB_BUILD
asm("PMMODEL equ 0F5Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WAITE                  :2;
        unsigned WAITM                  :4;
        unsigned WAITB                  :2;
    };
    struct {
        unsigned WAITE0                 :1;
        unsigned WAITE1                 :1;
        unsigned WAITM0                 :1;
        unsigned WAITM1                 :1;
        unsigned WAITM2                 :1;
        unsigned WAITM3                 :1;
        unsigned WAITB0                 :1;
        unsigned WAITB1                 :1;
    };
} PMMODELbits_t;
extern volatile PMMODELbits_t PMMODELbits __at(0xF5C);
// bitfield macros
#define _PMMODEL_WAITE_POSN                                 0x0
#define _PMMODEL_WAITE_POSITION                             0x0
#define _PMMODEL_WAITE_SIZE                                 0x2
#define _PMMODEL_WAITE_LENGTH                               0x2
#define _PMMODEL_WAITE_MASK                                 0x3
#define _PMMODEL_WAITM_POSN                                 0x2
#define _PMMODEL_WAITM_POSITION                             0x2
#define _PMMODEL_WAITM_SIZE                                 0x4
#define _PMMODEL_WAITM_LENGTH                               0x4
#define _PMMODEL_WAITM_MASK                                 0x3C
#define _PMMODEL_WAITB_POSN                                 0x6
#define _PMMODEL_WAITB_POSITION                             0x6
#define _PMMODEL_WAITB_SIZE                                 0x2
#define _PMMODEL_WAITB_LENGTH                               0x2
#define _PMMODEL_WAITB_MASK                                 0xC0
#define _PMMODEL_WAITE0_POSN                                0x0
#define _PMMODEL_WAITE0_POSITION                            0x0
#define _PMMODEL_WAITE0_SIZE                                0x1
#define _PMMODEL_WAITE0_LENGTH                              0x1
#define _PMMODEL_WAITE0_MASK                                0x1
#define _PMMODEL_WAITE1_POSN                                0x1
#define _PMMODEL_WAITE1_POSITION                            0x1
#define _PMMODEL_WAITE1_SIZE                                0x1
#define _PMMODEL_WAITE1_LENGTH                              0x1
#define _PMMODEL_WAITE1_MASK                                0x2
#define _PMMODEL_WAITM0_POSN                                0x2
#define _PMMODEL_WAITM0_POSITION                            0x2
#define _PMMODEL_WAITM0_SIZE                                0x1
#define _PMMODEL_WAITM0_LENGTH                              0x1
#define _PMMODEL_WAITM0_MASK                                0x4
#define _PMMODEL_WAITM1_POSN                                0x3
#define _PMMODEL_WAITM1_POSITION                            0x3
#define _PMMODEL_WAITM1_SIZE                                0x1
#define _PMMODEL_WAITM1_LENGTH                              0x1
#define _PMMODEL_WAITM1_MASK                                0x8
#define _PMMODEL_WAITM2_POSN                                0x4
#define _PMMODEL_WAITM2_POSITION                            0x4
#define _PMMODEL_WAITM2_SIZE                                0x1
#define _PMMODEL_WAITM2_LENGTH                              0x1
#define _PMMODEL_WAITM2_MASK                                0x10
#define _PMMODEL_WAITM3_POSN                                0x5
#define _PMMODEL_WAITM3_POSITION                            0x5
#define _PMMODEL_WAITM3_SIZE                                0x1
#define _PMMODEL_WAITM3_LENGTH                              0x1
#define _PMMODEL_WAITM3_MASK                                0x20
#define _PMMODEL_WAITB0_POSN                                0x6
#define _PMMODEL_WAITB0_POSITION                            0x6
#define _PMMODEL_WAITB0_SIZE                                0x1
#define _PMMODEL_WAITB0_LENGTH                              0x1
#define _PMMODEL_WAITB0_MASK                                0x40
#define _PMMODEL_WAITB1_POSN                                0x7
#define _PMMODEL_WAITB1_POSITION                            0x7
#define _PMMODEL_WAITB1_SIZE                                0x1
#define _PMMODEL_WAITB1_LENGTH                              0x1
#define _PMMODEL_WAITB1_MASK                                0x80

// Register: PMMODEH
#define PMMODEH PMMODEH
extern volatile unsigned char           PMMODEH             __at(0xF5D);
#ifndef _LIB_BUILD
asm("PMMODEH equ 0F5Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE16                 :1;
        unsigned INCM0                  :1;
        unsigned INCM1                  :1;
        unsigned IRQM0                  :1;
        unsigned IRQM1                  :1;
        unsigned BUSY                   :1;
    };
} PMMODEHbits_t;
