MikroElektronika/core_packages/PIC/XC8/def/PIC18LF44J11/mcu.h
#define                                 PSA_bit             _BIT_ACCESS(T0CON,3)
// PMCONH<PSIDL>
extern volatile __bit                   PSIDL               __at(0x7AFD);	// @ (0xF5F * 8 + 5)
#define                                 PSIDL_bit           _BIT_ACCESS(PMCONH,5)
// PIE1<PSPIE>
extern volatile __bit                   PSPIE               __at(0x7CEF);	// @ (0xF9D * 8 + 7)
#define                                 PSPIE_bit           _BIT_ACCESS(PIE1,7)
// PIR1<PSPIF>
extern volatile __bit                   PSPIF               __at(0x7CF7);	// @ (0xF9E * 8 + 7)
#define                                 PSPIF_bit           _BIT_ACCESS(PIR1,7)
// IPR1<PSPIP>
extern volatile __bit                   PSPIP               __at(0x7CFF);	// @ (0xF9F * 8 + 7)
#define                                 PSPIP_bit           _BIT_ACCESS(IPR1,7)
// ECCP1AS<PSS1AC0>
extern volatile __bit                   PSS1AC0             __at(0x7DF2);	// @ (0xFBE * 8 + 2)
#define                                 PSS1AC0_bit         _BIT_ACCESS(ECCP1AS,2)
// ECCP1AS<PSS1AC1>
extern volatile __bit                   PSS1AC1             __at(0x7DF3);	// @ (0xFBE * 8 + 3)
#define                                 PSS1AC1_bit         _BIT_ACCESS(ECCP1AS,3)
// ECCP1AS<PSS1BD0>
extern volatile __bit                   PSS1BD0             __at(0x7DF0);	// @ (0xFBE * 8 + 0)
#define                                 PSS1BD0_bit         _BIT_ACCESS(ECCP1AS,0)
// ECCP1AS<PSS1BD1>
extern volatile __bit                   PSS1BD1             __at(0x7DF1);	// @ (0xFBE * 8 + 1)
#define                                 PSS1BD1_bit         _BIT_ACCESS(ECCP1AS,1)
// ECCP2AS<PSS2AC0>
extern volatile __bit                   PSS2AC0             __at(0x7DC2);	// @ (0xFB8 * 8 + 2)
#define                                 PSS2AC0_bit         _BIT_ACCESS(ECCP2AS,2)
// ECCP2AS<PSS2AC1>
extern volatile __bit                   PSS2AC1             __at(0x7DC3);	// @ (0xFB8 * 8 + 3)
#define                                 PSS2AC1_bit         _BIT_ACCESS(ECCP2AS,3)
// ECCP2AS<PSS2BD0>
extern volatile __bit                   PSS2BD0             __at(0x7DC0);	// @ (0xFB8 * 8 + 0)
#define                                 PSS2BD0_bit         _BIT_ACCESS(ECCP2AS,0)
// ECCP2AS<PSS2BD1>
extern volatile __bit                   PSS2BD1             __at(0x7DC1);	// @ (0xFB8 * 8 + 1)
#define                                 PSS2BD1_bit         _BIT_ACCESS(ECCP2AS,1)
// PMCONH<PTBEEN>
extern volatile __bit                   PTBEEN              __at(0x7AFA);	// @ (0xF5F * 8 + 2)
#define                                 PTBEEN_bit          _BIT_ACCESS(PMCONH,2)
// PMEL<PTEN0>
extern volatile __bit                   PTEN0               __at(0x7AB0);	// @ (0xF56 * 8 + 0)
#define                                 PTEN0_bit           _BIT_ACCESS(PMEL,0)
// PMEL<PTEN1>
extern volatile __bit                   PTEN1               __at(0x7AB1);	// @ (0xF56 * 8 + 1)
#define                                 PTEN1_bit           _BIT_ACCESS(PMEL,1)
// PMEH<PTEN10>
extern volatile __bit                   PTEN10              __at(0x7ABA);	// @ (0xF57 * 8 + 2)
#define                                 PTEN10_bit          _BIT_ACCESS(PMEH,2)
// PMEH<PTEN11>
extern volatile __bit                   PTEN11              __at(0x7ABB);	// @ (0xF57 * 8 + 3)
#define                                 PTEN11_bit          _BIT_ACCESS(PMEH,3)
// PMEH<PTEN12>
extern volatile __bit                   PTEN12              __at(0x7ABC);	// @ (0xF57 * 8 + 4)
#define                                 PTEN12_bit          _BIT_ACCESS(PMEH,4)
// PMEH<PTEN13>
extern volatile __bit                   PTEN13              __at(0x7ABD);	// @ (0xF57 * 8 + 5)
#define                                 PTEN13_bit          _BIT_ACCESS(PMEH,5)
// PMEH<PTEN14>
extern volatile __bit                   PTEN14              __at(0x7ABE);	// @ (0xF57 * 8 + 6)
#define                                 PTEN14_bit          _BIT_ACCESS(PMEH,6)
// PMEH<PTEN15>
extern volatile __bit                   PTEN15              __at(0x7ABF);	// @ (0xF57 * 8 + 7)
#define                                 PTEN15_bit          _BIT_ACCESS(PMEH,7)
// PMEL<PTEN2>
extern volatile __bit                   PTEN2               __at(0x7AB2);	// @ (0xF56 * 8 + 2)
#define                                 PTEN2_bit           _BIT_ACCESS(PMEL,2)
// PMEL<PTEN3>
extern volatile __bit                   PTEN3               __at(0x7AB3);	// @ (0xF56 * 8 + 3)
#define                                 PTEN3_bit           _BIT_ACCESS(PMEL,3)
// PMEL<PTEN4>
extern volatile __bit                   PTEN4               __at(0x7AB4);	// @ (0xF56 * 8 + 4)
#define                                 PTEN4_bit           _BIT_ACCESS(PMEL,4)
// PMEL<PTEN5>
extern volatile __bit                   PTEN5               __at(0x7AB5);	// @ (0xF56 * 8 + 5)
#define                                 PTEN5_bit           _BIT_ACCESS(PMEL,5)
// PMEL<PTEN6>
extern volatile __bit                   PTEN6               __at(0x7AB6);	// @ (0xF56 * 8 + 6)
#define                                 PTEN6_bit           _BIT_ACCESS(PMEL,6)
// PMEL<PTEN7>
extern volatile __bit                   PTEN7               __at(0x7AB7);	// @ (0xF56 * 8 + 7)
#define                                 PTEN7_bit           _BIT_ACCESS(PMEL,7)
// PMEH<PTEN8>
extern volatile __bit                   PTEN8               __at(0x7AB8);	// @ (0xF57 * 8 + 0)
#define                                 PTEN8_bit           _BIT_ACCESS(PMEH,0)
// PMEH<PTEN9>
extern volatile __bit                   PTEN9               __at(0x7AB9);	// @ (0xF57 * 8 + 1)
#define                                 PTEN9_bit           _BIT_ACCESS(PMEH,1)
// PMCONH<PTRDEN>
extern volatile __bit                   PTRDEN              __at(0x7AF8);	// @ (0xF5F * 8 + 0)
#define                                 PTRDEN_bit          _BIT_ACCESS(PMCONH,0)
// PMCONH<PTWREN>
extern volatile __bit                   PTWREN              __at(0x7AF9);	// @ (0xF5F * 8 + 1)
#define                                 PTWREN_bit          _BIT_ACCESS(PMCONH,1)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x7C01);	// @ (0xF80 * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x7C03);	// @ (0xF80 * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA5>
extern volatile __bit                   RA5                 __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// PORTA<RA6>
extern volatile __bit                   RA6                 __at(0x7C06);	// @ (0xF80 * 8 + 6)
#define                                 RA6_bit             _BIT_ACCESS(PORTA,6)
// PORTA<RA7>
extern volatile __bit                   RA7                 __at(0x7C07);	// @ (0xF80 * 8 + 7)
#define                                 RA7_bit             _BIT_ACCESS(PORTA,7)
// PORTB<RB0>
extern volatile __bit                   RB0                 __at(0x7C08);	// @ (0xF81 * 8 + 0)
#define                                 RB0_bit             _BIT_ACCESS(PORTB,0)
// PORTB<RB1>
extern volatile __bit                   RB1                 __at(0x7C09);	// @ (0xF81 * 8 + 1)
#define                                 RB1_bit             _BIT_ACCESS(PORTB,1)
// PORTB<RB2>
extern volatile __bit                   RB2                 __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 RB2_bit             _BIT_ACCESS(PORTB,2)
// PORTB<RB3>
extern volatile __bit                   RB3                 __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 RB3_bit             _BIT_ACCESS(PORTB,3)
// PORTB<RB4>
extern volatile __bit                   RB4                 __at(0x7C0C);	// @ (0xF81 * 8 + 4)
#define                                 RB4_bit             _BIT_ACCESS(PORTB,4)
// PORTB<RB5>
extern volatile __bit                   RB5                 __at(0x7C0D);	// @ (0xF81 * 8 + 5)
#define                                 RB5_bit             _BIT_ACCESS(PORTB,5)
// PORTB<RB6>
extern volatile __bit                   RB6                 __at(0x7C0E);	// @ (0xF81 * 8 + 6)
#define                                 RB6_bit             _BIT_ACCESS(PORTB,6)
// PORTB<RB7>
extern volatile __bit                   RB7                 __at(0x7C0F);	// @ (0xF81 * 8 + 7)
#define                                 RB7_bit             _BIT_ACCESS(PORTB,7)
// INTCON<RBIE>
extern volatile __bit                   RBIE                __at(0x7F93);	// @ (0xFF2 * 8 + 3)
#define                                 RBIE_bit            _BIT_ACCESS(INTCON,3)
// INTCON<RBIF>
extern volatile __bit                   RBIF                __at(0x7F90);	// @ (0xFF2 * 8 + 0)
#define                                 RBIF_bit            _BIT_ACCESS(INTCON,0)
// INTCON2<RBIP>
extern volatile __bit                   RBIP                __at(0x7F88);	// @ (0xFF1 * 8 + 0)
#define                                 RBIP_bit            _BIT_ACCESS(INTCON2,0)
// INTCON2<RBPU>
extern volatile __bit                   RBPU                __at(0x7F8F);	// @ (0xFF1 * 8 + 7)
#define                                 RBPU_bit            _BIT_ACCESS(INTCON2,7)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x7C10);	// @ (0xF82 * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// PIE1<RC1IE>
extern volatile __bit                   RC1IE               __at(0x7CED);	// @ (0xF9D * 8 + 5)
#define                                 RC1IE_bit           _BIT_ACCESS(PIE1,5)
// PIR1<RC1IF>
extern volatile __bit                   RC1IF               __at(0x7CF5);	// @ (0xF9E * 8 + 5)
#define                                 RC1IF_bit           _BIT_ACCESS(PIR1,5)
// IPR1<RC1IP>
extern volatile __bit                   RC1IP               __at(0x7CFD);	// @ (0xF9F * 8 + 5)
#define                                 RC1IP_bit           _BIT_ACCESS(IPR1,5)
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
// PIE3<RC2IE>
extern volatile __bit                   RC2IE               __at(0x7D1D);	// @ (0xFA3 * 8 + 5)
#define                                 RC2IE_bit           _BIT_ACCESS(PIE3,5)
// PIR3<RC2IF>
extern volatile __bit                   RC2IF               __at(0x7D25);	// @ (0xFA4 * 8 + 5)
#define                                 RC2IF_bit           _BIT_ACCESS(PIR3,5)
// IPR3<RC2IP>
extern volatile __bit                   RC2IP               __at(0x7D2D);	// @ (0xFA5 * 8 + 5)
#define                                 RC2IP_bit           _BIT_ACCESS(IPR3,5)
// PORTC<RC3>
extern volatile __bit                   RC3                 __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 RC3_bit             _BIT_ACCESS(PORTC,3)
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// PORTC<RC5>
extern volatile __bit                   RC5                 __at(0x7C15);	// @ (0xF82 * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// PORTC<RC6>
extern volatile __bit                   RC6                 __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 RC6_bit             _BIT_ACCESS(PORTC,6)
// PORTC<RC7>
extern volatile __bit                   RC7                 __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 RC7_bit             _BIT_ACCESS(PORTC,7)
// RCSTA1<RC8_9>
extern volatile __bit                   RC8_9               __at(0x7D66);	// @ (0xFAC * 8 + 6)
#define                                 RC8_9_bit           _BIT_ACCESS(RCSTA1,6)
// RCSTA2<RC8_92>
extern volatile __bit                   RC8_92              __at(0x7CE6);	// @ (0xF9C * 8 + 6)
#define                                 RC8_92_bit          _BIT_ACCESS(RCSTA2,6)
// RCSTA1<RC9>
extern volatile __bit                   RC9                 __at(0x7D66);	// @ (0xFAC * 8 + 6)
#define                                 RC9_bit             _BIT_ACCESS(RCSTA1,6)
// RCSTA2<RC92>
extern volatile __bit                   RC92                __at(0x7CE6);	// @ (0xF9C * 8 + 6)
#define                                 RC92_bit            _BIT_ACCESS(RCSTA2,6)
// RCSTA1<RCD8>
extern volatile __bit                   RCD8                __at(0x7D60);	// @ (0xFAC * 8 + 0)
#define                                 RCD8_bit            _BIT_ACCESS(RCSTA1,0)
// RCSTA2<RCD82>
extern volatile __bit                   RCD82               __at(0x7CE0);	// @ (0xF9C * 8 + 0)
#define                                 RCD82_bit           _BIT_ACCESS(RCSTA2,0)
// SSP1CON2<RCEN>
extern volatile __bit _DEPRECATED       RCEN                __at(0x7E2B);	// @ (0xFC5 * 8 + 3)
#define                                 RCEN_bit            _BIT_ACCESS(SSP1CON2,3)
// SSP1CON2<RCEN1>
extern volatile __bit                   RCEN1               __at(0x7E2B);	// @ (0xFC5 * 8 + 3)
#define                                 RCEN1_bit           _BIT_ACCESS(SSP1CON2,3)
// SSP2CON2<RCEN2>
extern volatile __bit                   RCEN2               __at(0x7B8B);	// @ (0xF71 * 8 + 3)
#define                                 RCEN2_bit           _BIT_ACCESS(SSP2CON2,3)
// BAUDCON1<RCIDL>
extern volatile __bit _DEPRECATED       RCIDL               __at(0x7BF6);	// @ (0xF7E * 8 + 6)
#define                                 RCIDL_bit           _BIT_ACCESS(BAUDCON1,6)
// BAUDCON1<RCIDL1>
extern volatile __bit                   RCIDL1              __at(0x7BF6);	// @ (0xF7E * 8 + 6)
#define                                 RCIDL1_bit          _BIT_ACCESS(BAUDCON1,6)
// BAUDCON2<RCIDL2>
extern volatile __bit                   RCIDL2              __at(0x7BE6);	// @ (0xF7C * 8 + 6)
#define                                 RCIDL2_bit          _BIT_ACCESS(BAUDCON2,6)
// PIE1<RCIE>
extern volatile __bit                   RCIE                __at(0x7CED);	// @ (0xF9D * 8 + 5)
#define                                 RCIE_bit            _BIT_ACCESS(PIE1,5)
// PIR1<RCIF>
extern volatile __bit                   RCIF                __at(0x7CF5);	// @ (0xF9E * 8 + 5)
#define                                 RCIF_bit            _BIT_ACCESS(PIR1,5)
// IPR1<RCIP>
extern volatile __bit                   RCIP                __at(0x7CFD);	// @ (0xF9F * 8 + 5)
#define                                 RCIP_bit            _BIT_ACCESS(IPR1,5)
// BAUDCON1<RCMT>
extern volatile __bit                   RCMT                __at(0x7BF6);	// @ (0xF7E * 8 + 6)
#define                                 RCMT_bit            _BIT_ACCESS(BAUDCON1,6)
// BAUDCON1<RCMT1>
extern volatile __bit                   RCMT1               __at(0x7BF6);	// @ (0xF7E * 8 + 6)
#define                                 RCMT1_bit           _BIT_ACCESS(BAUDCON1,6)
// BAUDCON2<RCMT2>
extern volatile __bit                   RCMT2               __at(0x7BE6);	// @ (0xF7C * 8 + 6)
#define                                 RCMT2_bit           _BIT_ACCESS(BAUDCON2,6)
// PORTA<RCV>
extern volatile __bit                   RCV                 __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 RCV_bit             _BIT_ACCESS(PORTA,5)
// PORTD<RD0>
extern volatile __bit                   RD0                 __at(0x7C18);	// @ (0xF83 * 8 + 0)
#define                                 RD0_bit             _BIT_ACCESS(PORTD,0)
// PORTD<RD1>
extern volatile __bit                   RD1                 __at(0x7C19);	// @ (0xF83 * 8 + 1)
#define                                 RD1_bit             _BIT_ACCESS(PORTD,1)
// T1CON<RD16>
extern volatile __bit _DEPRECATED       RD16                __at(0x7E69);	// @ (0xFCD * 8 + 1)
#define                                 RD16_bit            _BIT_ACCESS(T1CON,1)
// T3CON<RD163>
extern volatile __bit                   RD163               __at(0x7BCF);	// @ (0xF79 * 8 + 7)
#define                                 RD163_bit           _BIT_ACCESS(T3CON,7)
// PORTD<RD2>
extern volatile __bit                   RD2                 __at(0x7C1A);	// @ (0xF83 * 8 + 2)
#define                                 RD2_bit             _BIT_ACCESS(PORTD,2)
// PORTD<RD3>
extern volatile __bit                   RD3                 __at(0x7C1B);	// @ (0xF83 * 8 + 3)
#define                                 RD3_bit             _BIT_ACCESS(PORTD,3)
// PORTD<RD4>
extern volatile __bit                   RD4                 __at(0x7C1C);	// @ (0xF83 * 8 + 4)
#define                                 RD4_bit             _BIT_ACCESS(PORTD,4)
// PORTD<RD5>
extern volatile __bit                   RD5                 __at(0x7C1D);	// @ (0xF83 * 8 + 5)
#define                                 RD5_bit             _BIT_ACCESS(PORTD,5)
// PORTD<RD6>
extern volatile __bit                   RD6                 __at(0x7C1E);	// @ (0xF83 * 8 + 6)
#define                                 RD6_bit             _BIT_ACCESS(PORTD,6)
// PORTD<RD7>
extern volatile __bit                   RD7                 __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 RD7_bit             _BIT_ACCESS(PORTD,7)
// PORTE<RDE>
extern volatile __bit                   RDE                 __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 RDE_bit             _BIT_ACCESS(PORTE,0)
// PORTE<RDPU>
extern volatile __bit                   RDPU                __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 RDPU_bit            _BIT_ACCESS(PORTE,7)
// PMCONL<RDSP>
extern volatile __bit                   RDSP                __at(0x7AF0);	// @ (0xF5E * 8 + 0)
#define                                 RDSP_bit            _BIT_ACCESS(PMCONL,0)
// PORTE<RE0>
extern volatile __bit                   RE0                 __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 RE0_bit             _BIT_ACCESS(PORTE,0)
// PORTE<RE1>
extern volatile __bit                   RE1                 __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 RE1_bit             _BIT_ACCESS(PORTE,1)
// PORTE<RE2>
extern volatile __bit                   RE2                 __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 RE2_bit             _BIT_ACCESS(PORTE,2)
// PORTE<RE6>
extern volatile __bit                   RE6                 __at(0x7C26);	// @ (0xF84 * 8 + 6)
#define                                 RE6_bit             _BIT_ACCESS(PORTE,6)
// PORTE<RE7>
extern volatile __bit                   RE7                 __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 RE7_bit             _BIT_ACCESS(PORTE,7)
// SSP1STAT<READ_WRITE>
extern volatile __bit                   READ_WRITE          __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 READ_WRITE_bit      _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<READ_WRITE2>
extern volatile __bit                   READ_WRITE2         __at(0x7B9A);	// @ (0xF73 * 8 + 2)
#define                                 READ_WRITE2_bit     _BIT_ACCESS(SSP2STAT,2)
// PORTB<REFO>
extern volatile __bit                   REFO                __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 REFO_bit            _BIT_ACCESS(PORTB,2)
// WDTCON<REGSLP>
extern volatile __bit                   REGSLP              __at(0x7E07);	// @ (0xFC0 * 8 + 7)
#define                                 REGSLP_bit          _BIT_ACCESS(WDTCON,7)
// DSCONL<RELEASE>
extern volatile __bit                   RELEASE             __at(0x7A60);	// @ (0xF4C * 8 + 0)
#define                                 RELEASE_bit         _BIT_ACCESS(DSCONL,0)
// PORTE<REPU>
extern volatile __bit                   REPU                __at(0x7C26);	// @ (0xF84 * 8 + 6)
#define                                 REPU_bit            _BIT_ACCESS(PORTE,6)
// RCON<RI>
extern volatile __bit                   RI                  __at(0x7E84);	// @ (0xFD0 * 8 + 4)
#define                                 RI_bit              _BIT_ACCESS(RCON,4)
// PORTA<RJPU>
extern volatile __bit                   RJPU                __at(0x7C07);	// @ (0xF80 * 8 + 7)
#define                                 RJPU_bit            _BIT_ACCESS(PORTA,7)
// REFOCON<RODIV0>
extern volatile __bit                   RODIV0              __at(0x79E8);	// @ (0xF3D * 8 + 0)
#define                                 RODIV0_bit          _BIT_ACCESS(REFOCON,0)
// REFOCON<RODIV1>
extern volatile __bit                   RODIV1              __at(0x79E9);	// @ (0xF3D * 8 + 1)
#define                                 RODIV1_bit          _BIT_ACCESS(REFOCON,1)
// REFOCON<RODIV2>
extern volatile __bit                   RODIV2              __at(0x79EA);	// @ (0xF3D * 8 + 2)
#define                                 RODIV2_bit          _BIT_ACCESS(REFOCON,2)
// REFOCON<RODIV3>
extern volatile __bit                   RODIV3              __at(0x79EB);	// @ (0xF3D * 8 + 3)
#define                                 RODIV3_bit          _BIT_ACCESS(REFOCON,3)
// REFOCON<ROON>
extern volatile __bit                   ROON                __at(0x79EF);	// @ (0xF3D * 8 + 7)
#define                                 ROON_bit            _BIT_ACCESS(REFOCON,7)
// REFOCON<ROSEL>
extern volatile __bit                   ROSEL               __at(0x79EC);	// @ (0xF3D * 8 + 4)
#define                                 ROSEL_bit           _BIT_ACCESS(REFOCON,4)
// REFOCON<ROSSLP>
extern volatile __bit                   ROSSLP              __at(0x79ED);	// @ (0xF3D * 8 + 5)
#define                                 ROSSLP_bit          _BIT_ACCESS(REFOCON,5)
// PORTA<RP0>
extern volatile __bit                   RP0                 __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 RP0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RP1>
extern volatile __bit                   RP1                 __at(0x7C01);	// @ (0xF80 * 8 + 1)
#define                                 RP1_bit             _BIT_ACCESS(PORTA,1)
// PORTB<RP10>
extern volatile __bit                   RP10                __at(0x7C0F);	// @ (0xF81 * 8 + 7)
#define                                 RP10_bit            _BIT_ACCESS(PORTB,7)
// PORTC<RP11>
extern volatile __bit                   RP11                __at(0x7C10);	// @ (0xF82 * 8 + 0)
#define                                 RP11_bit            _BIT_ACCESS(PORTC,0)
// PORTC<RP12>
extern volatile __bit                   RP12                __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 RP12_bit            _BIT_ACCESS(PORTC,1)
// PORTC<RP13>
extern volatile __bit                   RP13                __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 RP13_bit            _BIT_ACCESS(PORTC,2)
// PORTC<RP14>
extern volatile __bit                   RP14                __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 RP14_bit            _BIT_ACCESS(PORTC,3)
// PORTC<RP15>
extern volatile __bit                   RP15                __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 RP15_bit            _BIT_ACCESS(PORTC,4)
// PORTC<RP16>
